Былков_ДА_70180166/src/Catalogs/ФормыОбученияСтудентов/ФормыОбученияСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФормыОбученияСтудентов</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Catalogs/ФормыОбученияСтудентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
    Если ЗначениеЗаполнено(Объект.Студент) Тогда
        ФормаОбученияСтудента = ПолучитьФормуОбученияСтудентаНаСервере(Объект.Студент);
        Объект.ФормаОбучения = ФормаОбученияСтудента;
    Иначе
        Объект.Факультет = Неопределено;
    КонецЕсли;
КонецПроцедуры        

&НаСервере
Функция ПолучитьФормуОбученияСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.ФормаОбучения КАК ФормаОбучения
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ФормаОбучения;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьФормОбученияСтудентов(Отказ, Объект.Студент, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьФормОбученияСтудентов(Отказ, Студент, Ссылка)

    Если Не ЗначениеЗаполнено(Студент) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   ФормыОбученияСтудентов.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.ФормыОбученияСтудентов КАК ФормыОбученияСтудентов
    |ГДЕ
    |   ФормыОбученияСтудентов.Студент = &Студент
    |   И ФормыОбученияСтудентов.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Выбранный студент уже записан!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры
